app/views/groups/show.html.erb

SELECT  "group_users".* FROM "group_users" WHERE "group_users"."group_id" = $1 AND "group_users"."user_id" = $2 LIMIT 1  [["group_id", 6], ["user_id", 1]]
---
<p><%= @group.description.capitalize %></p>
<% if (@group.public || (current_user and @group.group_users.find_by_user_id(current_user.id)) || current_user.role.name == "admin") %>

SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = $1 AND "users"."id" = $2  [["group_id", 6], ["id", 1]]
---
            <h3>Members</h3>
            <% @group.users.each do |user| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                <%= link_to user_profile_path(m.user) do %>
                    <% if m.user.avatar.exists? %>