app/views/posts/_comment_form.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT 1  [["post_id", 1]]
---
<%= form_for [@post, Comment.new] do |f| %>
  <% if Comment.new.errors.any? %>