app/views/posts/show.html.erb

<p><%= @post.content %></p>
<% if @post.user.avatar.exists? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

<h2><i class="fa fa-comments-o"></i> Comments</h2>
<% if @post.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT 1  [["post_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]