app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "chan"], ["user_id", 2], ["post_id", 1], ["created_at", "2015-03-01 16:10:16.103156"], ["updated_at", "2015-03-01 16:10:16.103156"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  def create
      @comment = Comment.new(comment_params)
      authorize @comment
      if params[:commentable_type] == "Post"
          @commentable    = Post.find(params[:commentable_id])
      elsif params[:commentable_type] == "Dream"
          @commentable    = Dream.find(params[:commentable_id])
      elsif params[:commentable_type] == "Comment"
          @commentable    = Comment.find(params[:commentable_id])
      end
      @comment.user = current_user
      @comment.commentable = @commentable
      if @comment.save
        flash[:notice] = "Comment published."
      else
        flash[:notice] = "Unable to publish your comment."
      end
      if params[:commentable_type] == "Post"
          redirect_to post_path(params[:commentable_id])
      elsif params[:commentable_type] == "Dream"
          redirect_to user_dream_path(user_id:Dream.find(params[:commentable_id]).user_id , id: params[:commentable_id])