app/controllers/friendships_controller.rb

    def create
      @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
      authorize @friendship
      if @friendship.save
---
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 1], ["user_id", 2], ["created_at", "2015-02-22 19:15:33.491828"], ["updated_at", "2015-02-22 19:15:33.491828"]]

    def destroy
      @friendship = current_user.friendships.find_by_friend_id(params[:friend_id])
      authorize @friendship
      @friendship.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT 1  [["user_id", 2], ["friend_id", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 1]]