app/controllers/groups_controller.rb

INSERT INTO "group_users" ("user_id", "manager?", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["manager?", "f"], ["group_id", 7], ["created_at", "2015-02-25 21:46:09.325312"], ["updated_at", "2015-02-25 21:46:09.325312"]]
INSERT INTO "groups" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "chan"], ["description", "chaaan"], ["created_at", "2015-02-25 19:42:29.010684"], ["updated_at", "2015-02-25 19:42:29.010684"]]
---
  def create
     @group  = Group.new(group_params)
     @creator = @group.group_users.build(:user_id => current_user.id, :manager => true)
     authorize @creator

     if @group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = $1 AND "users"."id" = $2  [["group_id", 6], ["id", 1]]
---
  def show
      @group = Group.find(params[:id])

      #friends
      @friends = Array.new
      current_user.friends.each do |friend|
          if current_user.inverse_friends.include?(friend) && !@group.users.include?(friend)