app/controllers/group_users_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["group_id", 8], ["created_at", "2015-02-25 21:56:52.124131"], ["updated_at", "2015-02-25 21:56:52.124131"]]
---
    def create
      @group = Group.find(params[:group_id])
      @member = @group.group_users.build(:user_id => params[:user_id])
      @member.manager? =true
      authorize @member
      if @member.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "group_users".* FROM "group_users" WHERE "group_users"."group_id" = $1 AND "group_users"."user_id" = $2 LIMIT 1  [["group_id", 8], ["user_id", 2]]
DELETE FROM "group_users" WHERE "group_users"."id" = $1  [["id", 6]]
---
    def destroy
      @group = Group.find(params[:group_id])
      @member = @group.group_users.find_by_user_id(params[:user_id])
      authorize @member
      @member.destroy