app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "kag adghmsvmashgf mahs aghsfsan"], ["content", "asdsadasd"], ["user_id", 1], ["created_at", "2015-02-26 17:08:34.160035"], ["updated_at", "2015-02-26 17:08:34.160035"]]
---
  def create
      @post = Post.new(post_params)
      @post.user = current_user
      authorize @post
      if @post.save