app/controllers/voters_controller.rb

  def create
    set_votable
    @voter = @votable.voters.build(:user_id => params[:user_id])
    @voter.positive = params[:positive]
    authorize @voter
    if @voter.positive
        @votable.votes += 1
        @votable.save
---
INSERT INTO "voters" ("user_id", "votable_id", "votable_type", "positive", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["votable_id", 1], ["votable_type", "Post"], ["positive", "t"], ["created_at", "2015-03-01 15:32:30.401793"], ["updated_at", "2015-03-01 15:32:30.401793"]]

  def destroy
    set_votable
    @voter = @votable.voters.find_by_user_id(params[:user_id])
    authorize @voter
    if @voter.positive
        @votable.votes -= 1
        @votable.save
    else
        @votable.votes += 1
        @votable.save
    end
    @voter.destroy
---
DELETE FROM "voters" WHERE "voters"."id" = $1  [["id", 1]]

      def set_votable
          if params[:votable_type] == 'Post'
              @votable = Post.find(params[:votable_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]