app/controllers/users/omniauth_callbacks_controller.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT 1  [["name", "registered"]]
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["last_sign_in_at", "2015-02-20 20:32:50.101063"], ["current_sign_in_at", "2015-02-21 16:20:28.269026"], ["sign_in_count", 3], ["updated_at", "2015-02-21 16:20:28.272040"], ["id", 1]]
---
  def twitter
      # You need to implement the method below in your model (e.g. app/models/user.rb)
      @user = User.from_omniauth(request.env["omniauth.auth"].except("extra"))

      if @user.persisted?
        sign_in_and_redirect @user, :event => :authentication #this will throw if @user is not activated
        set_flash_message(:notice, :success, :kind => "Twitter") if is_navigational_format?
      else
        session["devise.twitter_data"] = request.env["omniauth.auth"].except("extra")
        @user.email    = 'change@me.please'
        @user.password = Devise.friendly_token[0,20]
        @user.username = request.env["omniauth.auth.nickname"]
        @user.role     ||= Role.find_by_name('registered')
        @user.save