app/controllers/users/registrations_controller.rb

  def create
    if session[:omniauth] == nil
        if(@captcha.valid?)
            super do
                resource.points = 50
                resource.bio = ''
                resource.public_sleep_log = true
                resource.public_profile = true
                resource.role = Role.find_by_name('registered')
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT 1  [["name", "registered"]]